{
    "books": [
        {
            "id": 1,
            "img": "jsgoodparts",
            "title": "Javascript: The Good Parts",
            "author": "Douglas Crockford",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 2000.00,
            "desc": "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that's more reliable, readable, and maintainable than the language as a whole—a subset you can use to create truly extensible and efficient code."
        },
        {
            "id": 2,
            "img": "pythoncrashcourse",
            "title": "Python Crash Course: A Hands-On, Project-Based Introduction to Programming",
            "author": "Eric Matthes",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 4270.00,
            "desc": "Python Crash Course is a fast-paced, thorough introduction to Python that will have you writing programs, solving problems, and making things that work in no time.\n\nIn the first half of the book, you’ll learn about basic programming concepts, such as lists, dictionaries, classes, and loops, and practice writing clean and readable code with exercises for each topic. You’ll also learn how to make your programs interactive and how to test your code safely before adding it to a project. In the second half of the book, you’ll put your new knowledge into practice with three substantial projects: a Space Invaders–inspired arcade game, data visualizations with Python’s super-handy libraries, and a simple web app you can deploy online."
        },
        {
            "id": 3,
            "img": "selftaughtprogrammer",
            "title": "The Self-Taught Programmer: The Definitive Guide to Programming Professionally",
            "author": "Cory Althoff",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 3000.00,
            "desc": "I am a self-taught programmer. After a year of self-study, I learned to program well enough to land a job as a software engineer II at eBay. Once I got there, I realized I was severely under-prepared. I was overwhelmed by the amount of things I needed to know but hadn't learned yet. My journey learning to program, and my experience at my first job as a software engineer were the inspiration for this book.\n\nThis book is not just about learning to program; although you will learn to code. If you want to program professionally, it is not enough to learn to code; that is why, in addition to helping you learn to program, I also cover the rest of the things you need to know to program professionally that classes and books don't teach you. \"The Self-taught Programmer\" is a roadmap, a guide to take you from writing your first Python program, to passing your first technical interview."
        },
        {
            "id": 4,
            "img": "cleancode",
            "title": "Clean Code: A Handbook of Agile Software Craftsmanship",
            "author": "Robert C. Martin",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 8400.00,
            "desc": "Even bad code can function. But if code isn’t clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn’t have to be that way.\n\nNoted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship . Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code “on the fly” into a book that will instill within you the values of a software craftsman and make you a better programmer–but only if you work at it.\n\nWhat kind of work will you be doing? You’ll be reading code–lots of code. And you will be challenged to think about what’s right about that code, and what’s wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft."
        },
        {
            "id": 5,
            "img": "crackingcodinginterview",
            "title": "Cracking the Coding Interview: 189 Programming Questions and Solutions",
            "author": "Gayle Laakmann McDowell",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 5720.00,
            "desc": "I am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this as a candidate and as an interviewer.\n\nCracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.\n\nLearn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions."
        },
        {
            "id": 6,
            "img": "softskills",
            "title": "Soft Skills: The Software Developer's Life Manual",
            "author": "John Sonmez, Manning Publications",
            "type": "Audible Audiobook",
            "rating": 4.5,
            "price": 4410.00,
            "desc": "Soft Skills: The software developer's life manual is a unique guide, offering techniques and practices for a more satisfying life as a professional software developer. In it, developer and life coach John Sonmez addresses a wide range of important \"soft\" topics, from career and productivity to personal finance and investing, and even fitness and relationships, all from a developer-centric viewpoint."
        },
        {
            "id": 7,
            "img": "linuxprogramminginterface",
            "title": "The Linux Programming Interface: A Linux and UNIX System Programming Handbook",
            "author": "Michael Kerrisk",
            "type": "Print Hardcover",
            "rating": 5.0,
            "price": 10310.00,
            "desc": "The Linux Programming Interface (TLPI) is the definitive guide to the Linux and UNIX programming interface—the interface employed by nearly every application that runs on a Linux or UNIX system.\n\nIn this authoritative work, Linux programming expert Michael Kerrisk provides detailed descriptions of the system calls and library functions that you need in order to master the craft of system programming, and accompanies his explanations with clear, complete example programs.\n\nYou'll find descriptions of over 500 system calls and library functions, and more than 200 example programs, 88 tables, and 115 diagrams."
        },
        {
            "id": 8,
            "img": "c++gameprogramming",
            "title": "Beginning C++ Through Game Programming",
            "author": "Michael Dawson",
            "type": "Print Paperback",
            "rating": 4.0,
            "price": 4400.00,
            "desc": "When it comes to game programming, C++ is the name of the game. If you aspire to move from game player to game creator, it all starts with learning the fundamentals of C++ and game-programming basics. With BEGINNING C++ THROUGH GAME PROGRAMMING, FOURTH EDITION, you will find an up-to-date and thorough introduction to everything you need to get started--with no previous programming experience required. In the new fourth edition of this popular guide to learning C++, you will work with a complete program while learning each new concept and a game program at the end of each chapter. A final game project at the end of the book draws together everything you've learned. Written with the beginning programmer in mind, BEGINNING C++ THROUGH GAME PROGRAMMING, FOURTH EDITION is a great way to get started in game programming."
        },
        {
            "id": 9,
            "img": "gameprogrammingpatterns",
            "title": "Game Programming Patterns",
            "author": "Robert Nystrom",
            "type": "Print Paperback",
            "rating": 5,
            "price": 6360.00,
            "desc": "The biggest challenge facing many game programmers is completing their game. Most game projects fizzle out, overwhelmed by the complexity of their own code. Game Programming Patterns tackles that exact problem. Based on years of experience in shipped AAA titles, this book collects proven patterns to untangle and optimize your game, organized as independent recipes so you can pick just the patterns you need.\n\nYou will learn how to write a robust game loop, how to organize your entities using components, and take advantage of the CPUs cache to improve your performance. You'll dive deep into how scripting engines encode behavior, how quadtrees and other spatial partitions optimize your engine, and how other classic design patterns can be used in games."
        },
        {
            "id": 10,
            "img": "cprogramminglanguage",
            "title": "The C Programming Language",
            "author": "Brian W. Kernighan, Dennis M. Ritchie",
            "type": "Print Paperback",
            "rating": 4.5,
            "price": 930.00,
            "desc": "This ebook is the first authorized digital version of Kernighan and Ritchie’s 1988 classic, The C Programming Language (2nd Ed.). One of the best-selling programming books published in the last fifty years, \"K&R\" has been called everything from the \"bible\" to \"a landmark in computer science\" and it has influenced generations of programmers. Available now for all leading ebook platforms, this concise and beautifully written text is a \"must-have\" reference for every serious programmer’s digital library."
        }
    ]
}